data/web_scraping.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en-US" xml:lang="en-US">
<head>
<!-- 2017-10-07 Sat 22:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="data analysis, python, scraping" />
<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.proxy.ustclug.org/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7a786b3">1. BeautifulSoup</a>
<ul>
<li><a href="#org149e992">1.1. objects</a></li>
<li><a href="#orgaca47dd">1.2. find&amp;findAll</a></li>
<li><a href="#org33ae376">1.3. alternatives</a></li>
</ul>
</li>
<li><a href="#org018f92b">2. <b>scrapy</b> module</a>
<ul>
<li><a href="#org4030202">2.1. Output</a></li>
<li><a href="#orgb7c14df">2.2. Documentation</a></li>
</ul>
</li>
<li><a href="#orgb987503">3. Requests</a>
<ul>
<li><a href="#orgf7fc2c0">3.1. Basic use</a></li>
<li><a href="#orgfc6d188">3.2. cookies</a></li>
<li><a href="#org46ca12d">3.3. Session</a></li>
</ul>
</li>
<li><a href="#orgdc38c18">4. Selenium</a>
<ul>
<li><a href="#orgf9406c2">4.1. Waiting until fully loaded</a></li>
<li><a href="#orgc8c6d52">4.2. Selectors</a></li>
<li><a href="#org11a5b2a">4.3. Handling Redirects</a></li>
</ul>
</li>
<li><a href="#org4f460a0">5. Scaping Rule Checklist</a></li>
</ul>
</div>
</div>
<p>
f#+TITLE: Web Scraping
</p>
<div id="outline-container-org7a786b3" class="outline-2">
<h2 id="org7a786b3"><span class="section-number-2">1</span> BeautifulSoup</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org149e992" class="outline-3">
<h3 id="org149e992"><span class="section-number-3">1.1</span> objects</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgafa5f2d" class="outline-4">
<h4 id="orgafa5f2d"><span class="section-number-4">1.1.1</span> BeautifulSoup <i>objects</i></h4>
</div>
<div id="outline-container-orgcd16ed4" class="outline-4">
<h4 id="orgcd16ed4"><span class="section-number-4">1.1.2</span> Tag <i>objects</i></h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Retrieved in lists or individually by calling find and findAll on a BeautifulSoup object.
</p>
</div>
</div>
<div id="outline-container-org1eb57a8" class="outline-4">
<h4 id="org1eb57a8"><span class="section-number-4">1.1.3</span> NavigableString <i>objects</i></h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Used to represent text within tags, rather than the tags themselves (some functions
operate on, and produce, NavigableStrings , rather than tag objects).
</p>
</div>
</div>
<div id="outline-container-org07addb7" class="outline-4">
<h4 id="org07addb7"><span class="section-number-4">1.1.4</span> The Comment <i>object</i></h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Used to find HTML comments in comment tags
</p>
</div>
</div>
</div>

<div id="outline-container-orgaca47dd" class="outline-3">
<h3 id="orgaca47dd"><span class="section-number-3">1.2</span> find&amp;findAll</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-python">findAll<span style="color: #AE81FF;">(</span>name=<span style="color: #AE81FF;">None</span>, attrs=<span style="color: #66D9EF;">{}</span>, recursive=<span style="color: #AE81FF;">True</span>, text=<span style="color: #AE81FF;">None</span>, limit=<span style="color: #AE81FF;">None</span>, **kwargs<span style="color: #AE81FF;">)</span>
find<span style="color: #AE81FF;">(</span>name=<span style="color: #AE81FF;">None</span>, attrs=<span style="color: #66D9EF;">{}</span>, recursive=<span style="color: #AE81FF;">True</span>, text=<span style="color: #AE81FF;">None</span>, **kwargs<span style="color: #AE81FF;">)</span>
findAll<span style="color: #AE81FF;">(</span>fn<span style="color: #AE81FF;">)</span> <span style="color: #75715E;"># </span><span style="color: #75715E;">=&gt; fn(tag) : return bool</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org33ae376" class="outline-3">
<h3 id="org33ae376"><span class="section-number-3">1.3</span> alternatives</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>lxml: fast</li>
<li>HTML Parser: built-in</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org018f92b" class="outline-2">
<h2 id="org018f92b"><span class="section-number-2">2</span> <b>scrapy</b> module</h2>
<div class="outline-text-2" id="text-2">
<p>
create scraping project
</p>
<div class="org-src-container">
<pre class="src src-shell">scrapy startproject wikiSpider
</pre>
</div>
<pre class="example">
├── scrapy.cfg
└── project
    ├── __init__.py
    ├── items.py: Each Scrapy Item object represents a single page on the website
    ├── middlewares.py
    ├── pipelines.py
    ├── settings.py
    └── spiders
        ├── site_spider.py
        └── __init__.py
</pre>
</div>
<div id="outline-container-org4030202" class="outline-3">
<h3 id="org4030202"><span class="section-number-3">2.1</span> Output</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-shell">scrapy crawl spider_name -o some_items.csv -t csv
scrapy crawl spider_name -o some_items.json -t json
scrapy crawl spider_name -o some_items.xml -t xml
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb7c14df" class="outline-3">
<h3 id="orgb7c14df"><span class="section-number-3">2.2</span> <a href="http://doc.scrapy.org/en/latest/">Documentation</a></h3>
</div>
</div>

<div id="outline-container-orgb987503" class="outline-2">
<h2 id="orgb987503"><span class="section-number-2">3</span> Requests</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgf7fc2c0" class="outline-3">
<h3 id="orgf7fc2c0"><span class="section-number-3">3.1</span> Basic use</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #F92672;">import</span> requests
<span style="color: #FD971F;">params</span> = <span style="color: #AE81FF;">{</span><span style="color: #E6DB74;">'firstname'</span>: <span style="color: #E6DB74;">'Ryan'</span>, <span style="color: #E6DB74;">'lastname'</span>: <span style="color: #E6DB74;">'Mitchell'</span><span style="color: #AE81FF;">}</span>
<span style="color: #FD971F;">r</span> = requests.post<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"http://pythonscraping.com/files/processing.php"</span>, data=params<span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>r.text<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc6d188" class="outline-3">
<h3 id="orgfc6d188"><span class="section-number-3">3.2</span> cookies</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #F92672;">import</span> requests
<span style="color: #FD971F;">params</span> = <span style="color: #AE81FF;">{</span><span style="color: #E6DB74;">'username'</span>: <span style="color: #E6DB74;">'Ryan'</span>, <span style="color: #E6DB74;">'password'</span>: <span style="color: #E6DB74;">'password'</span><span style="color: #AE81FF;">}</span>
<span style="color: #FD971F;">r</span> = requests.post<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"http://pythonscraping.com/pages/cookies/welcome.php"</span>, params<span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>r.cookies.get_dict<span style="color: #66D9EF;">()</span><span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">r</span> = requests.get<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"http://pythonscraping.com/pages/cookies/profile.php"</span>, cookies=r.cookies<span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>r.text<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org46ca12d" class="outline-3">
<h3 id="org46ca12d"><span class="section-number-3">3.3</span> Session</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #FD971F;">session</span> = requests.Session<span style="color: #AE81FF;">()</span>
<span style="color: #FD971F;">params</span> = <span style="color: #AE81FF;">{</span><span style="color: #E6DB74;">'username'</span>: <span style="color: #E6DB74;">'username'</span>, <span style="color: #E6DB74;">'password'</span>: <span style="color: #E6DB74;">'password'</span><span style="color: #AE81FF;">}</span>
<span style="color: #FD971F;">s</span> = session.post<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"http://pythonscraping.com/pages/cookies/welcome.php"</span>, params<span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>s.cookies.get_dict<span style="color: #66D9EF;">()</span><span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">s</span> = session.get<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"http://pythonscraping.com/pages/cookies/profile.php"</span><span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>s.text<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdc38c18" class="outline-2">
<h2 id="orgdc38c18"><span class="section-number-2">4</span> Selenium</h2>
<div class="outline-text-2" id="text-4">
<p>
often using with non-GUI engine PhantomJS
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #FD971F;">driver</span> = webdriver.PhantomJS<span style="color: #AE81FF;">(</span>executable_path=<span style="color: #E6DB74;">''</span><span style="color: #AE81FF;">)</span>
driver.get<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"http://pythonscraping.com/pages/javascript/ajaxDemo.html"</span><span style="color: #AE81FF;">)</span>
time.sleep<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>driver.find_element_by_id<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"content"</span><span style="color: #66D9EF;">)</span>.text<span style="color: #AE81FF;">)</span>
driver.close<span style="color: #AE81FF;">()</span>
</pre>
</div>
</div>

<div id="outline-container-orgf9406c2" class="outline-3">
<h3 id="orgf9406c2"><span class="section-number-3">4.1</span> Waiting until fully loaded</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #F92672;">from</span> selenium.webdriver.common.by <span style="color: #F92672;">import</span> By
<span style="color: #F92672;">from</span> selenium.webdriver.support.ui <span style="color: #F92672;">import</span> WebDriverWait
<span style="color: #F92672;">from</span> selenium.webdriver.support <span style="color: #F92672;">import</span> expected_conditions <span style="color: #F92672;">as</span> EC
<span style="color: #FD971F;">driver</span> = webdriver.PhantomJS<span style="color: #AE81FF;">(</span>executable_path=<span style="color: #E6DB74;">''</span><span style="color: #AE81FF;">)</span>
driver.get<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"http://pythonscraping.com/pages/javascript/ajaxDemo.html"</span><span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">try</span>:
    <span style="color: #FD971F;">element</span> = WebDriverWait<span style="color: #AE81FF;">(</span>driver, <span style="color: #AE81FF;">10</span><span style="color: #AE81FF;">)</span>.until<span style="color: #AE81FF;">(</span>
        EC.presence_of_element_located<span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>By.ID, <span style="color: #E6DB74;">"loadedButton"</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">finally</span>:
    <span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>driver.find_element_by_id<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"content"</span><span style="color: #66D9EF;">)</span>.text<span style="color: #AE81FF;">)</span>
    driver.close<span style="color: #AE81FF;">()</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc8c6d52" class="outline-3">
<h3 id="orgc8c6d52"><span class="section-number-3">4.2</span> Selectors</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The following locator selection strategies can used with the By object:
</p>
<ul class="org-ul">
<li>ID: Used in the example; finds elements by their HTML id attribute.</li>
<li>CLASS_NAME</li>
</ul>

<p>
Used to find elements by their HTML class attribute. Why is this function CLASS_NAME: and not simply CLASS?
Using the form object.CLASS would create problems for Selenium’s Java library, where .class is a reserved method.
In order to keep the Selenium syntax consistent between different languages, CLASS_NAME was used instead.
</p>

<ul class="org-ul">
<li>CSS_SELECTOR</li>
</ul>

<p>
Find elements by their class, id, or tag name, using the #idName, .className, tagName convention.
</p>

<ul class="org-ul">
<li>LINK_TEXT</li>
</ul>

<p>
Finds HTML &lt;a&gt; tags by the text they contain. For example, a link that says
“Next” can be selected using (By.LINK_TEXT, "Next").
</p>

<ul class="org-ul">
<li>PARTIAL_LINK_TEXT: Similar to LINK_TEXT , but matches on a partial string.</li>
<li>NAME: Finds HTML tags by their name attribute. This is handy for HTML forms.</li>
<li>TAG_NAME: Finds HTML tags by their tag name.</li>
<li>XPATH: Uses an XPath expression (the syntax of which is described in the upcoming sidebar) to select matching elements.</li>
</ul>
</div>
</div>

<div id="outline-container-org11a5b2a" class="outline-3">
<h3 id="org11a5b2a"><span class="section-number-3">4.3</span> Handling Redirects</h3>
<div class="outline-text-3" id="text-4-3">
<p>
We can detect that redirect in a clever way by “watching” an element in the DOM
when the page initially loads, then repeatedly calling that element until Selenium
throws a StaleElementReferenceException ; that is, the element is no longer
attached to the page’s DOM and the site has redirected:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #F92672;">from</span> selenium <span style="color: #F92672;">import</span> webdriver
<span style="color: #F92672;">import</span> time
<span style="color: #F92672;">from</span> selenium.webdriver.remote.webelement <span style="color: #F92672;">import</span> WebElement
<span style="color: #F92672;">from</span> selenium.common.exceptions <span style="color: #F92672;">import</span> StaleElementReferenceException
<span style="color: #F92672;">def</span> <span style="color: #A6E22E;">waitForLoad</span><span style="color: #AE81FF;">(</span>driver<span style="color: #AE81FF;">)</span>:
    <span style="color: #FD971F;">elem</span> = driver.find_element_by_tag_name<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"html"</span><span style="color: #AE81FF;">)</span>
    <span style="color: #FD971F;">count</span> = <span style="color: #AE81FF;">0</span>
    <span style="color: #F92672;">while</span> <span style="color: #AE81FF;">True</span>:
        <span style="color: #FD971F;">count</span> += <span style="color: #AE81FF;">1</span>
        <span style="color: #F92672;">if</span> count &gt; <span style="color: #AE81FF;">20</span>:
            <span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"Timing out after 10 seconds and returning"</span><span style="color: #AE81FF;">)</span>
            <span style="color: #F92672;">return</span>
    time.sleep<span style="color: #AE81FF;">(</span>.<span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">)</span>
    <span style="color: #F92672;">try</span>:
        elem == driver.find_element_by_tag_name<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"html"</span><span style="color: #AE81FF;">)</span>
    <span style="color: #F92672;">except</span> StaleElementReferenceException:
        <span style="color: #F92672;">return</span>
<span style="color: #FD971F;">driver</span> = webdriver.PhantomJS<span style="color: #AE81FF;">(</span>executable_path=<span style="color: #E6DB74;">'&lt;Path to Phantom JS&gt;'</span><span style="color: #AE81FF;">)</span>
driver.get<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"http://pythonscraping.com/pages/javascript/redirectDemo1.html"</span><span style="color: #AE81FF;">)</span>
waitForLoad<span style="color: #AE81FF;">(</span>driver<span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>driver.page_source<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4f460a0" class="outline-2">
<h2 id="org4f460a0"><span class="section-number-2">5</span> Scaping Rule Checklist</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>First, if the page you are receiving from the web server is blank, missing information, or is otherwise not what you expect (or have seen in your own browser), it is likely caused by JavaScript being executed on the site to create the page.</li>
<li>If you are submitting a form or making a POST request to a website, check the page to make sure that everything the website is expecting you to submit is being submitted and in the correct format. Use a tool such as Chrome’s Network inspector to view an actual POST command sent to the site to make sure you’ve got everything.</li>
<li>If you are trying to log into a site and can’t make the login “stick,” or the website is experiencing other strange “state” behavior, check your cookies. Make sure that cookies are being persisted correctly between each page load and that your cookies are sent to the site for every request.</li>
<li>If you are getting HTTP errors from the client, especially 403 Forbidden errors, it might indicate that the website has identified your IP address as a bot and is unwilling to accept any more requests. You will need to either wait until your IP address is removed from the list, or obtain a new IP address. To make sure you don’t get blocked again, try the following:
<ul class="org-ul">
<li>Make sure that your scrapers aren’t moving through the site too quickly. Fast scraping is a bad practice that places a heavy burden on the web administrator’s servers, can land you in legal trouble, and is the number-one cause of scrapers getting blacklisted. Add delays to your scrapers and let them run overnight. Remember: Being in a rush to write programs or gather data is a sign of bad project management; plan ahead to avoid messes like this in the first place.</li>
<li>The obvious one: change your headers! Some sites will block anything that advertises itself as a scraper. Copy your own browser’s headers if you’re unsure about what some reasonable header values are.</li>
<li>Make sure you’re not clicking on or accessing anything that a human normally would not be able to</li>
<li>If you find yourself jumping through a lot of difficult hoops to gain access, consider contacting the website administrator to let them know what you’re doing. Try emailing webmaster@&lt;domain name&gt; or admin@&lt;domain name&gt; for permission to use your scrapers. Admins are people, too!</li>
</ul></li>
</ul>
</div>
</div>
</div>
</body>
</html>
